
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-1/actions/runs/5032833373)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.oidc.aws_iam_policy.Terraform-OIDC-sample
  * module.oidc.aws_iam_role.set-oidc-provider


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.oidc.aws_iam_policy.Terraform-OIDC-sample will be created
  + resource "aws_iam_policy" "Terraform-OIDC-sample" {
      + arn         = (known after apply)
      + description = "Terraform-OIDC-sample"
      + id          = (known after apply)
      + name        = "Terraform-OIDC-sample"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Effect    = "Allow"
                      + NotAction = [
                          + "iam:CreateServiceLinkedRole",
                          + "iam:DeleteServiceLinkedRole",
                          + "iam:ListRoles",
                          + "organizations:DescribeOrganization",
                          + "account:ListRegions",
                        ]
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:CreateServiceLinkedRole",
                          + "iam:DeleteServiceLinkedRole",
                          + "iam:ListRoles",
                          + "organizations:DescribeOrganization",
                          + "account:ListRegions",
                          + "iam:GetPolicy",
                          + "iam:GetOpenIDConnectProvider",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::021077554300:role/set-oidc-provider"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.oidc.aws_iam_role.set-oidc-provider will be created
  + resource "aws_iam_role" "set-oidc-provider" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:hikobend/aws-sample-architecture-1:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::021077554300:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sample-oidc"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":15,"Program":"tfcmt","SHA1":"c08a766f288d081247343755c0a977b11d96d250","Vars":{},"WorkflowName":"terraform plan"} -->